In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.364249
   2   -1.854719
   3   -0.175869
b  1   -0.598615
   3   -0.187795
c  1   -0.621606
   2    1.131116
d  2    1.054491
   3    1.573425
dtype: float64

In [3]:
data['a'][2]

-1.85471892920561

In [11]:
data.loc[['a','c','b']]

a  1   -0.364249
   2   -1.854719
   3   -0.175869
b  1   -0.598615
   3   -0.187795
c  1   -0.621606
   2    1.131116
dtype: float64

In [15]:
data.loc[:, [2,1]]

a  1   -0.364249
   2   -1.854719
b  1   -0.598615
c  1   -0.621606
   2    1.131116
d  2    1.054491
dtype: float64

In [19]:
val1 = data.unstack()
val1

          1         2         3
a -0.364249 -1.854719 -0.175869
b -0.598615       NaN -0.187795
c -0.621606  1.131116       NaN
d       NaN  1.054491  1.573425

In [21]:
val1.stack()

a  1   -0.364249
   2   -1.854719
   3   -0.175869
b  1   -0.598615
   3   -0.187795
c  1   -0.621606
   2    1.131116
d  2    1.054491
   3    1.573425
dtype: float64

In [25]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Pakistan', 'Pakistan', 'India'],
                              ['Karachi', 'Lahore', 'Banglore']])
frame

    Pakistan           India
     Karachi Lahore Banglore
a 1        0      1        2
  2        3      4        5
b 1        6      7        8
  2        9     10       11

In [29]:
frame['Pakistan'].loc['b',2]

Karachi     9
Lahore     10
Name: (b, 2), dtype: int32

In [35]:
frame['Pakistan'].iloc[3]

Karachi     9
Lahore     10
Name: (b, 2), dtype: int32

In [36]:
frame.index.names = ['key1', 'key2']
frame

          Pakistan           India
           Karachi Lahore Banglore
key1 key2
a    1           0      1        2
     2           3      4        5
b    1           6      7        8
     2           9     10       11

In [37]:
frame.columns.names = ['Country', 'City']
frame

Country   Pakistan           India
City       Karachi Lahore Banglore
key1 key2
a    1           0      1        2
     2           3      4        5
b    1           6      7        8
     2           9     10       11

In [40]:
frame['Pakistan']['Lahore']['b'][2]

10